/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        psm_timemgr.h
 *
 * @brief       省电时钟管理接口
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-05-11     ICT Team          创建
 ************************************************************************************
 */
#ifndef __PSM_TIMEMGR__
#define __PSM_TIMEMGR__

#include <drv_pcu.h>
#include <psm_core.h>

/**
 * @addtogroup Psm
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define RTC_SHADOW_LOW                      LSP_SBY_SHADOW3
#define RTC_SHADOW_HIGH                     LSP_SBY_SHADOW2
#define TICK_SHADOW_LOW                     LSP_SBY_SHADOW5
#define TICK_SHADOW_HIGH                    LSP_SBY_SHADOW4

/************************************************************************************
 *                                 函数定义
 ************************************************************************************/
/**
 ************************************************************************************
 * @brief           TimeMgr休眠入口，配置休眠唤醒timer
 *
 * @param[in]       sleep_time         休眠时长
 *
 * @return          void
 * @retval          null
 ************************************************************************************
*/
int TimeMgr_SetWakeupTimer(uint64_t sleep_time, PSM_Mode mode);

/**
 ************************************************************************************
 * @brief           TimeMgr休眠出口，获取休眠唤醒时长
 *
 * @param[in]       sleep_time         休眠时长
 *
 * @return          void
 * @retval          null
 ************************************************************************************
*/
void TimeMgr_GetSleepTimelen(uint64_t *       sleep_time);

#ifdef _CPU_AP
/**
 ************************************************************************************
 * @brief          保存standby休眠时长配置
 *
 * @param[in]       void
 *
 * @return          void
 * @retval          null
 ************************************************************************************
*/
void TimeMgr_StandbyWKTimeSet(void);

/**
 ************************************************************************************
 * @brief           清除standby休眠时长配置
 *
 * @param[in]       void
 *
 * @return          void
 * @retval          null
 ************************************************************************************
*/
void TimeMgr_StandbyWKTimeClr(void);

/**
 ************************************************************************************
 * @brief           standby唤醒，TICK初始化
 *
 * @param[in]       void
 *
 * @return          void
 * @retval          null
 ************************************************************************************
*/
void TimeMgr_CompensateTick(void);
#endif
#endif
/** @} */