/**
 ******************************************************************************
 * @file    list.h
 * @brief   通用双向循环链表
 *
 * ============================================================================
 * 使用说明
 * ============================================================================
 *
 * 一、定义结构体
 *
 * typedef struct device
 * {
 *     int id;
 *     char name[32];
 *
 *     list_head_t node;
 *
 * } device_t;
 *
 * ============================================================================
 * 二、定义链表
 * ============================================================================
 *
 * LIST_HEAD(devices);
 *
 * 或
 *
 * list_head_t devices;
 * list_init(&devices);
 *
 * ============================================================================
 * 三、插入节点
 * ============================================================================
 *
 * device_t dev;
 *
 * list_init(&dev.node);
 *
 * list_add(&dev.node, &devices);       //头插
 *
 * list_add_tail(&dev.node, &devices);  //尾插
 *
 * ============================================================================
 * 四、遍历
 * ============================================================================
 *
 * device_t *dev;
 *
 * list_for_each_entry(
 *     dev,
 *     &devices,
 *     node,
 *     device_t)
 * {
 *     printf("%d\n", dev->id);
 * }
 *
 * ============================================================================
 * 五、安全遍历删除
 * ============================================================================
 *
 * device_t *dev;
 * device_t *tmp;
 *
 * list_for_each_entry_safe(
 *     dev,
 *     tmp,
 *     &devices,
 *     node,
 *     device_t)
 * {
 *     if(dev->id == 1)
 *     {
 *         list_del(&dev->node);
 *     }
 * }
 *
 * ============================================================================
 * 六、动态对象
 * ============================================================================
 *
 * device_t *dev = malloc(sizeof(device_t));
 *
 * list_init(&dev->node);
 *
 * list_add_tail(&dev->node, &devices);
 *
 * ...
 *
 * list_del(&dev->node);
 *
 * free(dev);
 *
 ******************************************************************************
 */

 #ifndef LIST_H
 #define LIST_H
 
 #include <stddef.h>
 
 #ifdef __cplusplus
 extern "C" {
 #endif
 
 /******************************************************************************
  * container_of
  ******************************************************************************/
 
 #ifndef container_of
 #define container_of(ptr, type, member) \
     ((type *)((char *)(ptr) - offsetof(type, member)))
 #endif
 
 /******************************************************************************
  * list_head
  ******************************************************************************/
 
 typedef struct list_head
 {
     struct list_head *prev;
     struct list_head *next;
 } list_head_t;
 
 /******************************************************************************
  * 静态初始化
  ******************************************************************************/
 
 #define LIST_HEAD_INIT(name) \
     { &(name), &(name) }
 
 /******************************************************************************
  * 定义并初始化链表头
  ******************************************************************************/
 
 #define LIST_HEAD(name) \
     list_head_t name = LIST_HEAD_INIT(name)
 
 /******************************************************************************
  * 初始化链表
  ******************************************************************************/
 
 static inline void list_init(list_head_t *head)
 {
     head->next = head;
     head->prev = head;
 }
 
 /******************************************************************************
  * 判断链表是否为空
  ******************************************************************************/
 
 static inline int list_empty(const list_head_t *head)
 {
     return head->next == head;
 }
 
 /******************************************************************************
  * 是否只有一个节点
  ******************************************************************************/
 
 static inline int list_is_singular(const list_head_t *head)
 {
     return !list_empty(head) &&
            (head->next == head->prev);
 }
 
 /******************************************************************************
  * 是否为最后一个节点
  ******************************************************************************/
 
 static inline int list_is_last(
     const list_head_t *entry,
     const list_head_t *head)
 {
     return entry->next == head;
 }
 
 /******************************************************************************
  * 内部插入
  ******************************************************************************/
 
 static inline void __list_add(
     list_head_t *node,
     list_head_t *prev,
     list_head_t *next)
 {
     next->prev = node;
     node->next = next;
 
     node->prev = prev;
     prev->next = node;
 }
 
 /******************************************************************************
  * 头插
  ******************************************************************************/
 
 static inline void list_add(
     list_head_t *node,
     list_head_t *head)
 {
     __list_add(node, head, head->next);
 }
 
 /******************************************************************************
  * 尾插
  ******************************************************************************/
 
 static inline void list_add_tail(
     list_head_t *node,
     list_head_t *head)
 {
     __list_add(node, head->prev, head);
 }
 
 /******************************************************************************
  * 内部删除
  ******************************************************************************/
 
 static inline void __list_del(
     list_head_t *prev,
     list_head_t *next)
 {
     prev->next = next;
     next->prev = prev;
 }
 
 /******************************************************************************
  * 删除节点
  ******************************************************************************/
 
 static inline void list_del(list_head_t *entry)
 {
     __list_del(entry->prev, entry->next);
 
     entry->next = NULL;
     entry->prev = NULL;
 }
 
 /******************************************************************************
  * 删除并重新初始化
  ******************************************************************************/
 
 static inline void list_del_init(list_head_t *entry)
 {
     __list_del(entry->prev, entry->next);
 
     list_init(entry);
 }
 
 /******************************************************************************
  * 替换节点
  ******************************************************************************/
 
 static inline void list_replace(
     list_head_t *old,
     list_head_t *node)
 {
     node->next = old->next;
     node->prev = old->prev;
 
     old->prev->next = node;
     old->next->prev = node;
 }
 
 /******************************************************************************
  * 移动到头部
  ******************************************************************************/
 
 static inline void list_move(
     list_head_t *node,
     list_head_t *head)
 {
     __list_del(node->prev, node->next);
     list_add(node, head);
 }
 
 /******************************************************************************
  * 移动到尾部
  ******************************************************************************/
 
 static inline void list_move_tail(
     list_head_t *node,
     list_head_t *head)
 {
     __list_del(node->prev, node->next);
     list_add_tail(node, head);
 }
 
 /******************************************************************************
  * 获取数量
  ******************************************************************************/
 
 static inline int list_count(
     const list_head_t *head)
 {
     int count = 0;
 
     const list_head_t *pos;
 
     for (pos = head->next;
          pos != head;
          pos = pos->next)
     {
         count++;
     }
 
     return count;
 }
 
 /******************************************************************************
  * 获取首节点
  ******************************************************************************/
 
 static inline list_head_t *list_front(
     list_head_t *head)
 {
     return list_empty(head)
                ? NULL
                : head->next;
 }
 
 /******************************************************************************
  * 获取尾节点
  ******************************************************************************/
 
 static inline list_head_t *list_back(
     list_head_t *head)
 {
     return list_empty(head)
                ? NULL
                : head->prev;
 }
 
 /******************************************************************************
  * 获取结构体
  ******************************************************************************/
 
 #define list_entry(ptr, type, member) \
     container_of(ptr, type, member)
 
 /******************************************************************************
  * 获取第一个结构体
  ******************************************************************************/
 
 #define list_first_entry(head, type, member) \
     list_entry((head)->next, type, member)
 
 /******************************************************************************
  * 获取最后一个结构体
  ******************************************************************************/
 
 #define list_last_entry(head, type, member) \
     list_entry((head)->prev, type, member)
 
 /******************************************************************************
  * 节点遍历
  ******************************************************************************/
 
 #define list_for_each(pos, head) \
     for ((pos) = (head)->next; \
          (pos) != (head); \
          (pos) = (pos)->next)
 
 /******************************************************************************
  * 反向遍历
  ******************************************************************************/
 
 #define list_for_each_prev(pos, head) \
     for ((pos) = (head)->prev; \
          (pos) != (head); \
          (pos) = (pos)->prev)
 
 /******************************************************************************
  * 安全遍历节点
  ******************************************************************************/
 
 #define list_for_each_safe(pos, n, head) \
     for ((pos) = (head)->next, \
          (n) = (pos)->next; \
          (pos) != (head); \
          (pos) = (n), \
          (n) = (pos)->next)
 
 /******************************************************************************
  * 遍历结构体
  ******************************************************************************/
 
 #define list_for_each_entry(pos, head, member, type) \
     for ((pos) = list_entry((head)->next, type, member); \
          &(pos)->member != (head); \
          (pos) = list_entry((pos)->member.next, type, member))
 
 /******************************************************************************
  * 安全遍历结构体
  ******************************************************************************/
 
 #define list_for_each_entry_safe(pos, n, head, member, type) \
     for ((pos) = list_entry((head)->next, type, member), \
          (n) = list_entry((pos)->member.next, type, member); \
          &(pos)->member != (head); \
          (pos) = (n), \
          (n) = list_entry((n)->member.next, type, member))
 
 #ifdef __cplusplus
 }
 #endif
 
 #endif /* LIST_H */