/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        nvparam_config.h
 *
 * @brief       NV定义配置.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-04-21     ict team          创建
 ************************************************************************************
 */


#ifndef _NV_CONFIGS_H_
#define _NV_CONFIGS_H_

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stddef.h>
#include <stdint.h>


/************************************************************************************
 *                                 配置开关
 ************************************************************************************/


/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define NV_FACTORY_PART_NAME        "nvf"       ///< 工厂区分区名
#define NV_DEFAULT_PART_NAME        "nvd"       ///< 出厂区分区名
#define NV_CURWORK_PART_NAME        "nvw"       ///< 工作区分区名

/************************************************************************************
 *                                 NV Factory Size
 ************************************************************************************/

#define VERSION_NUMBER_LEN          (40)        ///< 版本信息最大长度

#define NV_FACTORY_SIZE             (28*1024)   ///< 工厂区配置大小(校准参数等), 禁止修改

#define NV_FACTORY_RESV_SIZE        (20*1024)   ///< 工厂区保留段大小

/************************************************************************************
 *                                 NV Default Size
 ************************************************************************************/

#define NV_MODEM_SIZE               (20*1024)   ///< Modem 配置大小, 禁止修改

#define NV_PUBCONFIG_SIZE           (2*1024)    ///< 公共配置大小, 禁止修改

#define NV_CUSTOMCFG_SIZE           (2*1024-8)  ///< 公共配置大小, 禁止修改

#define NV_FLAGINFO_SIZE            (8)         ///< 标志区大小, 禁止修改

#define NV_LEAVE_FACTORY_SIZE       (NV_MODEM_SIZE + NV_PUBCONFIG_SIZE + NV_CUSTOMCFG_SIZE + NV_FLAGINFO_SIZE)   ///< 出厂区大小, 禁止修改

/***************************
 RO area 16KB
***************************/
#define MODEM_PHYUSER_SIZE          (12 * 1024)

#define MODEM_ROPLAT_SIZE           (2 * 1024)

#define MODEM_ROPSCFG_SIZE          (2 * 1024)

#define MODEM_RONV_SIZE             (MODEM_PHYUSER_SIZE + MODEM_ROPLAT_SIZE + MODEM_ROPSCFG_SIZE)

/***************************
 RW area 8KB
***************************/
#define MODEM_RWPLAT_SIZE           (96)
#define MODEM_RWPSEXT_SIZE          (88)
#define MODEM_RWIMS_SIZE            (512 - MODEM_RWPSEXT_SIZE)
#define MODEM_RWPSCFG_SIZE          (4096 - MODEM_RWPLAT_SIZE - MODEM_RWIMS_SIZE - MODEM_RWPSEXT_SIZE)

/************************************************************************************
 *                                 NV Factory 地址定义
 ************************************************************************************/

#define NV_FACTORY_ADDR                (0x0)          ///< 生产校准区起始地址

#define NV_FACTORY_SIMLOCK_ADDR        (NV_FACTORY_ADDR + NV_FACTORY_RESV_SIZE)  ///< SIMLOCK起始地址


/************************************************************************************
 *                                 测试宏
 ************************************************************************************/

#ifndef BUILD_BUG_ON
#define BUILD_BUG_ON(cond)          ((void)sizeof(char[1-2*!!(cond)]))
#endif

#ifndef MEMBER_SIZE
#define MEMBER_SIZE(type, member)   (sizeof(((type*)(0x0))->member))
#endif

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/


/************************************************************************************
 *                                 函数定义
 ************************************************************************************/

#endif /*_NV_CONFIGS_H_*/
