/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        app_at_fota.h
 *
 * @brief       FOTA AT声明
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-28     ict team          创建
 ************************************************************************************
 */

#ifndef __AT_FOTA_H__
#define __AT_FOTA_H__

#include <stddef.h>
#include <stdint.h>

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
typedef enum {
    CME_ERR_FOTA_OK             = 0,
    CME_ERR_FOTA_GENERAL        = 502,
    CME_ERR_FOTA_BAD_PACKAGE    = 504,
    CME_ERR_FOTA_IMAGE_UNMATCH  = 510,
    CME_ERR_FOTA_NO_SPACE       = 511,

    CME_ERR_FOTA_FTP            = 601,
    CME_ERR_FOTA_HTTP           = 701,

    CME_ERR_FOTA_MAX            = 9999      ///<   CME ERROR错误码支持最多4位
}CME_FOTAErr;

/************************************************************************************
 *                                 函数声明
 ************************************************************************************/
void AT_FOTARead(uint8_t channelId);
void AT_FOTASet(uint8_t channelId, uint8_t *cmd, uint16_t cmdLen);
void AT_FOTATest(uint8_t channelId);

#endif /* __AT_FOTA_H__ */
