/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-01     ict team          创建
 ************************************************************************************
 */

#ifndef __SVC_USAT_H__
#define __SVC_USAT_H__

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stdint.h>
#include <ctype.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define USAT_DATA_MAX (255)    // USAT数据的最大长度

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
/* USAT主动式命令 */
typedef struct
{
    uint32_t dataLen;   //  数据长度
    uint8_t data[USAT_DATA_MAX];    //  数据
} SVC_USAT_ProactiveCommandInfo;

/************************************************************************************
 *                                 函数声明
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief 向UICC发送terminal response
 *
 * @param[in] buf 要发送的数据
 * @param[in] buf_len  要发送的数据长度
 *
 * @return  osOK：成功，其他值：失败
 * @note   同步接口会阻塞任务，禁止在AT命令处理函数中调用
 ************************************************************************************
*/
int svc_usat_set_terminal_response(uint8_t *buf, uint32_t buf_len);

/**
 ************************************************************************************
 * @brief 向UICC发送envelope command
 *
 * @param[in] buf 要发送的数据
 * @param[in] buf_len  要发送的数据长度
 *
 * @return  osOK：成功，其他值：失败
 * @note   同步接口会阻塞任务，禁止在AT命令处理函数中调用
 ************************************************************************************
*/
int svc_usat_set_envelope_command(uint8_t *buf, uint32_t buf_len);
#ifdef __cplusplus
}
#endif
#endif /* __SVC_USAT_H__ */
