/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-01     ict team          创建
 ************************************************************************************
 */

#ifndef __SVC_SMS_H__
#define __SVC_SMS_H__

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stdint.h>
#include <ctype.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define SVC_SMS_PDU_SIZE               (400)

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
/* 新短信上报 对应消息 SVC_EVT_SMS_NEWSMS_IND */
typedef struct {
    uint16_t    length; //    tp-du长度
    char        pdu[SVC_SMS_PDU_SIZE]; // pdu内容
} SVC_SMS_SmsInd;

/**
 * @brief 发送短信消息结构体
 * @param length，短信内容长度
 * @param pdu, pdu内容，包括SMC
 */
/* 发送短信消息结构体 */
typedef struct {
    uint16_t     length; //   tp-du长度, 对应cmgs后面的参数
    char         pdu[SVC_SMS_PDU_SIZE]; //    16进制字符pdu内容, cgms添加SUB后直接发送
} SVC_SMS_SendSmsReq;

/**
 * @brief 短信中心上报，对应消息 SVC_EVT_SMS_CSCA_IND
 * @param sca, 短信中心地址
 * @param tosca, <sca>的类型
 * @param result, 执行结果
 */
typedef struct {
    char sca[22];
    uint8_t tosca;
    int32_t result;
} SVC_SMS_CscaInd;

/************************************************************************************
 *                                 函数声明
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief    发送短信接口 发送AT+CMGS命令
 *
 * @param[in] 短信内容PDU串
 *
 * @return
 * @note  接口会用全局变量缓存发送的内容, 多条短信发送时请串行调用
 *        发送结果在消息 SVC_EVT_SMS_SEND_RESULT 中返回
 ************************************************************************************
*/
int svc_sms_send_sms(SVC_SMS_SendSmsReq *sendSMSReq);
/**
 ************************************************************************************
 * @brief    获取短信中心 发送AT+CSCA?命令
 *
 * @param[in] none
 *
 * @return
 * @note 短信中心 SVC_EVT_SMS_CSCA_IND 中返回
 ************************************************************************************
*/
int svc_sms_read_csca(void);

/**
 ************************************************************************************
 * @brief    配置短信中心 发送AT+CSCA=<str_sca>命令
 *
 * @param[in] 短信中心地址
 *
 * @return
 * @note 设置结果在 SVC_EVT_SMS_CSCA_SET_RESULT 中返回
 ************************************************************************************
*/
int svc_sms_set_csca(char *str_sca);

/**
 ************************************************************************************
 * @brief    删除短信 发送AT+CMGD命令
 *
 * @param[in] index  要删除的短信index值。非0为有效值，0表示不指定index
 * @param[in] delflag  当不指定index时，选择删除短信的类型
 *
 * @return
 * @note
 * 一、index使用说明：
 * 当不指定Index时，delflag才生效
 * 二、<delflag>取值如下描述
 * 0  (或缺省) 删除由<index>指定的短消息
 * 1  删除首选存储器上所有的已读短消息，保留未读短消息、已发送短消息和未发送短消息
 * 2  删除首选存储器上所有的已读短消息和已发送短消息，保留未读短消息和未发送短消息
 * 3  删除首选存储器上所有的已读短消息、已发送短消息和未发送短消息，保留未读短消息
 * 4  删除首选存储器上所有短消息，包括未读短消息
 * 三、删除结果在 SVC_EVT_SMS_CMGD_SET_RESULT 消息中上报
 ************************************************************************************
*/
int svc_sms_delete(uint16_t index, uint8_t delflag);

#ifdef __cplusplus
}
#endif
#endif /* __SVC_SMS_H__ */
