/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-01     ict team          创建
 ************************************************************************************
 */

#ifndef __SVC_CALL_H__
#define __SVC_CALL_H__

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stdint.h>
#include <ctype.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
/* DSCI 呼叫过程主动上报 */
typedef struct
{
    uint8_t id;         //  呼叫标识 1~7
    uint8_t dir;        //  0 用户发起的呼叫MO，1 用户终结的呼叫MT
    /*  呼叫的状态
        0   活动中
        1   保持中
        2   拨号中（MO呼叫）
        3   振铃中（MO呼叫）
        4   来电建立中（MT呼叫）
        5   等待中
        6   呼叫结束
        7   来电接听中
        8   呼叫释放中
    */
    uint8_t stat;       //  呼叫的状态
    uint8_t type;       //  呼叫的类型 0         语音业务            1   数据业务
    uint8_t mpty;       //  是否处于多方通话中           1：呼叫在多方通话中            0：呼叫不在多方通话中
    char number[40];    //  呼叫地址号码
    uint8_t num_type;   //  地址类型
} SVC_CALL_DsciInfo;

/* CEND 呼叫结束主动上报 */
typedef struct
{
    uint8_t id;             //  呼叫标识 1~7
    uint8_t end_status;     //  呼叫的状态
    uint8_t cc_cause;       //  呼叫结束原因
} SVC_CALL_CendInfo;


/************************************************************************************
 *                                 函数声明
 ************************************************************************************/
/**
 ************************************************************************************
 * @brief    ATD发起呼叫 发送ATD<str_num>;命令
 *
 * @param[in] str_num   呼叫的号码
 *
 * @return
 * @note 配置结果通过 SVC_EVT_CALL_SET_ATD_RESULT 消息上报
 ************************************************************************************
*/
int svc_call_set_atd(char *str_num);

/**
 ************************************************************************************
 * @brief    ATA接听呼叫 发送ATA命令
 *
 * @param[in] 无
 *
 * @return
 * @note 配置结果通过 SVC_EVT_CALL_SET_ATA_RESULT 消息上报
 ************************************************************************************
*/
int svc_call_set_ata(void);

/**
 ************************************************************************************
 * @brief    CHUP挂断呼叫 发送AT+CHUP命令
 *
 * @param[in] 无
 *
 * @return
 * @note 配置结果通过 SVC_EVT_CALL_SET_CHUP_RESULT 消息上报
 ************************************************************************************
*/
int svc_call_set_chup(void);
#ifdef __cplusplus
}
#endif
#endif /* __SVC_CALL_H__ */
