/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-01     ict team          创建
 ************************************************************************************
 */

#ifndef __SVC_EQUIPMENT_H__
#define __SVC_EQUIPMENT_H__

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stdint.h>
#include <ctype.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define SVC_EQP_IMEI_SIZE (16)
/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
#define SVC_EQP_NCELL_MAX    6 //  支持的最大邻小区个数
typedef struct
{
    char        str_oper[6];    //  数字plmn,只需要5个字符
    uint16_t    tac;            //  TrackingAreaCode
    uint32_t    cell_id;
    uint16_t    pci;
    int16_t     real_rsrp;
} SVC_EQP_CellInfo;

/************************************************************************************
 *                                 函数声明
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief 获取设备IMEI
 *
 * @param[out] p_imei 至少SVC_EQP_IMEI_SIZE大小空间，用于存放IMEI
 * @param[in] buf_len  描述p_imei空间大小
 *
 * @return  osOK：成功，其他值：失败
 * @note   同步接口会阻塞任务，禁止在AT命令处理函数中调用
 ************************************************************************************
*/
int svc_eqp_read_imei(char *p_imei, uint32_t buf_len);
/**
 ************************************************************************************
 * @brief 获取设备小区信息
 *
 * @param[in] arr_cellinfo 存放小区信息的数组
 * @param[in] arr_count  描述数组arr_cellinfo中SVC_EQP_CellInfo个数,最多输出
 *
 * @return  osOK：成功，其他值：失败
 * @note
 * 1.同步接口会阻塞任务，禁止在AT命令处理函数中调用，该接口会阻塞较长时间
 * 2.最多输出SVC_EQP_NCELL_MAX个小区信息, 因此数组arr_cellinfo成员个数不要超过SVC_EQP_NCELL_MAX
 * 3.arr_cellinfo中str_oper为空表示无效数据
 ************************************************************************************
*/
int svc_eqp_read_cellinfo(SVC_EQP_CellInfo *arr_cellinfo, uint8_t arr_count);
#ifdef __cplusplus
}
#endif
#endif /* __SVC_EQUIPMENT_H__ */
