/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        drv_kti.h
 *
 * @brief       KTI驱动接口(模拟环境使用).
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-05-11     ICT Team         创建
 ************************************************************************************
 */

#ifndef _DRV_KTI_H_
#define _DRV_KTI_H_

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <os.h>
#include <drv_dma.h>

/**
 * @addtogroup Kti
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
typedef void (*KTI_CallBack)(void *userData);

typedef struct
{
    const struct KTI_Res  *pRes;
    // High level data & callback;
    void *userData;
    KTI_CallBack InputCallback;
} KTI_Handle;

/************************************************************************************
 *                                 函数声明
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief           初始化KTI控制器
 *
 * @param[in]       handle                     KTI控制器句柄
 *
 * @return          初始化结果.
 * @retval          ==0                        初始化成功
 ************************************************************************************
 */
extern int32_t KTI_Initialize(KTI_Handle *handle);  

/**
 ************************************************************************************
 * @brief           去初始化KTI控制器
 *
 * @param[in]       handle                     KTI控制器句柄
 *
 * @return          无.
 ************************************************************************************
 */
extern int32_t KTI_Uninitialize(KTI_Handle *handle);

/**
 ************************************************************************************
 * @brief           读取数据
 *
 * @param[in]       handle                     KTI控制器句柄
 * @param[in]       data                       读取的缓存
 * @param[in]       len                        读取的缓存长度
 *
 * @return          读取结果.
 * @retval          > 0                        读取长度
 *                  < 0                        读取失败，无数据等情况
 * @note            中断回调后，才接收数据
 *************************************************************************************
 */
extern int32_t KTI_GetData(KTI_Handle *handle, uint8_t *data, uint8_t len);

/**
 *************************************************************************************
 * @brief           发送数据
 *
 * @param[in]       handle                     LCD控制器句柄
 * @param[in]       data                       待发数据
 * @param[in]       len                        长度
 *
 * @return          发送结果.
 * @retval          ==0                        发送成功
 *                  < 0                        失败
 * @note            函数发送完毕后，才返回
 *************************************************************************************
 */
extern int32_t KTI_PutData(KTI_Handle *handle, uint8_t *data, uint8_t len);

#endif /* End of _DRV_KTI_H_*/
/** @} */