/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        drv_pwm_audio.h
 *
 * @brief       pwm audio驱动接口.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-04-21     ict team          创建
 ************************************************************************************
 */
#ifndef __PWM_AUDIO_H__
#define __PWM_AUDIO_H__

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <drv_common.h>

/**
 * @addtogroup PwmAudio
 */

/**@{*/

/************************************************************************************
 *                                 配置开关
 ************************************************************************************/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define AUDIO_SAMPLE_WIDTH_16           16
#define AUDIO_SAMPLE_WIDTH_8            8  

#define AUDIO_SAMPLE_RATE_44_1K         44100
#define AUDIO_SAMPLE_RATE_16K           16000
#define AUDIO_SAMPLE_RATE_8K            8000

#define PWM_AUDIO_BUF_NUM               2

#define  PWM_AUDIO_GAIN_COFF            10

typedef void (*PwmAudio_CallBackType)(void *arg);
/************************************************************************************
 *                                 函数定义
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief           PWM Audio 初始化
 * 
 * @param[in]       sampleWidth                 采样宽度，AUDIO_SAMPLE_WIDTH_16 或者 AUDIO_SAMPLE_WIDTH_8
 * @param[in]       sampleRate                  采样率，例如：16000
 * @param[in]       cb                          调用者回调
 * @return          void.
 ************************************************************************************
 */
void PwmAudio_Initialize(uint8_t sampleWidth, uint16_t sampleRate, PwmAudio_CallBackType cb);

/**
 ************************************************************************************
 * @brief           启动PWM Audio输出音频
 *
 * @param[in]       pcmData                     第一次给PWMAudio 的PCM 音频数据
 * @param[in]       dataSize                    pcmData数据大小，该大小是PwmAudio_InsertData每次
 *                                              填充数据大小的PWM_AUDIO_BUF_NUM倍
 * 
 * @return          void.
 ************************************************************************************
 */
int8_t PwmAudio_Start(const uint8_t *pcmData, uint32_t dataSize);

/**
 ************************************************************************************
 * @brief           持续补充播放音频数据，该接口在回调中使用，用于及时补充后续的音频数据
 *
 * @param[in]       pcmData                     音频数据
 * @param[in]       dataSize                    pcmData数据大小，大小为PwmAudio_Start接口中
 *                                              DataSize/PWM_AUDIO_BUF_NUM
 * 
 * @return          void.
 ************************************************************************************
 */
int8_t PwmAudio_InsertData(const uint8_t *pcmData, uint32_t dataSize);
/**
 ************************************************************************************
 * @brief           PWM Audio 停止
 * 
 * @return          void.
 ************************************************************************************
 */
void PwmAudio_Stop(void);

/**
 ************************************************************************************
 * @brief           PWM Audio 去初始化, 资源释放
 *
 * @return          void.
 ************************************************************************************
 */
void PwmAudio_Uninitialize(void);

/**
 ************************************************************************************
 * @brief           启动普通PWM 功能
 * 
 * @param duty      pwm 高电平时间，单位us
 * @param period    pwm 单个周期总时间，单位us
 * 
 * @return          int8_t.  
 *                  -1: 失败
 *                   0：成功
 ************************************************************************************
 */
int8_t PWM_Start(uint32_t duty, uint32_t period);

/**
 ************************************************************************************
 * @brief           停止普通PWM 功能
 * 
 * @return          void.  

 ************************************************************************************
 */
void PWM_Stop(void);

/**
 ************************************************************************************
 * @brief           设置PWM 支持输出范围， 默认是 1.5HZ~104K. 该接口用于后期扩展，
 *                  一般不需要设置，设置方式值换算如下：
 *                  MAX_FREQ: 104MHz/val
 *                  MIN_FREQ: 104MHz/val/65535
 * @return          void.  
 ************************************************************************************
 */
void PWM_SetPeriodRange(uint32_t val);
#endif
/** @} */