/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        drv_.h
 *
 * @brief       ADC驱动接口.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-04-21     ict team          创建
 ************************************************************************************
 */

#ifndef __DAC_H__
#define __DAC_H__
/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <drv_common.h>

/**
 * @addtogroup Dac
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define DAC_BUF_NUM                         2

#define DAC_HW_CLOCK_TRIG                   4
#define DAC_TIM2_TRIG                       2
#define DAC_TIM1_TRIG                       1

#define STOP_DAC_DMA                        1
#define STOP_DAC                            2

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/

typedef void (*DAC_CallBack)(uint32_t arg);

typedef struct 
{
    uint32_t sampleRate;    /** 采样率 */
    uint8_t sampleWidth;    /** 采样点位数 */
    uint16_t frameSize;     /** 帧大小*/
}DacCfg;
/************************************************************************************
 *                                 函数定义
 ************************************************************************************/
/**
 ************************************************************************************
 * @brief           DAC初始化
 *
 * @param[in]       DAC                     数据发送触发类型（DAC_HW_CLOCK_TRIG、DAC_TIM2_TRIG、
 *                                          DAC_TIM1_TRIG）默认 DAC_HW_CLOCK_TRIG
 * @param[in]       dacOutFreq              dac 输出频率，也代表音频中的采样率    
 * @param[in]       sampleWidth             音频的采样位数，12、16、24   
 * @param[in]       cb                      用户回调接口
 *  
 * @return          返回值.
 * @retval          0                       成功
 *                  <0                      失败
 ************************************************************************************
 */
int8_t DAC_Initialize(uint8_t trigType, uint32_t dacOutFreq, uint8_t sampleWidth, DAC_CallBack cb);

/**
 ************************************************************************************
 * @brief           DAC 插入数据，在传输过程中修改DMA Bufffer 数据类容
 *
 * @param[in]       data                传输数据指针
 * @param[in]       dataSize            数据大小
 *
 * @return          返回值.
 * @retval          0                       成功
 *                  <0                      失败
 ************************************************************************************
 */
int8_t DAC_InsertData(const uint8_t *data, uint32_t dataSize);

/**
 ************************************************************************************
 * @brief           DAC 数据传输启动
 *
 * @param[in]       data                传输数据指针
 * @param[in]       dataSize            数据大小，此大小为DAC_InsertData 中 dataSize DAC_BUF_NUM 倍
 *
 * @return          返回值.
 * @retval          0                       成功
 *                  <0                      失败
 ************************************************************************************
 */
int8_t DAC_Start(const uint8_t *data, uint32_t dataSize);

/**
 ************************************************************************************
 * @brief           DAC 停止，可以停止设备或DMA传输
 *
 * @param[in]       stopFunc                停止STOP_DAC_DMA 或者 STOP_DAC
 *
 * @return          void.
 ************************************************************************************
 */
void DAC_Stop(uint8_t stopFunc);

/**
 ************************************************************************************
 * @brief           DAC 去初始化，资源释放
 *
 * @param[in]       void
 *
 * @return          void.
 ************************************************************************************
 */
void DAC_Uninitialize(void);

/**
 ************************************************************************************
 * @brief           音频数据转换为12 bit DAC 数据
 *
 * @param[in]       data            需要转换的数据
 * @param[in]       size            数据的大小
 * @param[in]       audioDataBits   数据的采样位数 16、12、24等
 *
 * @return          void.
 ************************************************************************************
 */
void DAC_ConvertDataTo12Bit(uint8_t *data, uint32_t size, uint8_t audioDataBits);

/////////////////////////////DAC EXT 接口/////////////////////////////////////////
/**
 ************************************************************************************
 * @brief           Dac 内部配置
 *
 * @param[in]       frameSize            需要转换的数据帧大小
 *
 * @return          0 成功， 非0失败
 ************************************************************************************
 */
int8_t DAC_Ext_Cfg(uint32_t frameSize);

/**
 ************************************************************************************
 * @brief           音频数据写入
 *
 * @param[in]       cfg                DAC 配置，参考DacCfg结构体
 *
 * @return          0 成功， 非0失败
 ************************************************************************************
 */
int8_t Dac_Open(DacCfg *cfg);
/**
 ************************************************************************************
 * @brief           音频数据写入
 *
 * @param[in]       data                传输数据指针
 * @param[in]       size                数据大小
 * @param[in]       timeOut             超时时间
 *
 * @return          <0失败， >=0 实际写入数据
 ************************************************************************************
 */
int32_t Dac_Write(const uint8_t *data, uint32_t size, uint32_t timeOut);

/**
 ************************************************************************************
 * @brief           DAC 关闭
 *
 * @param[in]       void
 *
 * @return          0 成功， 非0失败
 ************************************************************************************
 */
void Dac_Close(void);

/**
 ************************************************************************************
 * @brief           DAC 输出固定电平初始化
 *
 * @param[in]       void
 *
 * @return          0 成功， 非0失败
 ************************************************************************************
 */
int8_t DAC_FixedLevelInit(void);

/**
 ************************************************************************************
 * @brief           DAC 输出固定电平
 *
 * @param[in]       level   写入的电平数据 
 *                          voltage range: 0~2.5V 
 *                          level range: 0~4095 
 *                          voltage = level/4095*2.5V
 *
 * @return          0 成功， 非0失败
 ************************************************************************************
 */
int8_t DAC_SetFixedLevel(uint16_t level);

#endif

/** @} */