/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        drv_timer.h
 *
 * @brief       Timer驱动接口.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-04-21     ict team          创建
 ************************************************************************************
 */
#ifndef __DRIVER_TIMER_H__
#define __DRIVER_TIMER_H__

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include "drv_common.h"

/**
 * @addtogroup Timer
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define         TIMER_PERIOD_MODE           0
#define         TIMER_ONE_SHOT_MODE         1
/************************************************************************************
 *                                 类型定义
 ************************************************************************************/

/**
 * @brief 每个硬件timer, 有独立控制2个通道
 */
typedef enum
{
    /* 通用 */
    TIMER0= 0,
    TIMER1,           
    /* 省电使用 */
    PWM_TIMER0_0,
    PWM_TIMER0_1,
    PWM_TIMER1_0,
    PWM_TIMER1_1,
    MAX_TIMER
}TIM_Td;

/**
 * @brief 回调类型
 */
typedef void (*TimCallBack) (uint32_t event);  

/**
 * @brief Timer 操作句柄结构体
 */
typedef struct
{
    TimCallBack callBack;           /* 定时器回调函数 */
    uint8_t timMode;                /* timer 工作模式， 周期性 或 单次  */
    uint64_t totalTime;             /* 累计时间, clock source */
}TIM_Handle;

/************************************************************************************
 *                                 函数定义
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief           请求一个Timer，并分配资源.
 *
 * @param[in]       timId             Timer Id
 * @param[in]       cb                  Timer回调函数
 * 
 * @return          申请返回值.
 * @retval          !NULL             申请成功的Timer操作句柄
 *                  NULL              失败
 ************************************************************************************
 */
TIM_Handle* TIM_Request(uint8_t timId, TimCallBack cb);

/**
 ************************************************************************************
 * @brief           释放一个Timer.
 *
 * @param[in]       handle            Timer操作句柄
 * 
 * @return          void.
 ************************************************************************************
 */
void TIM_Release(TIM_Handle **handle);

/**
 ************************************************************************************
 * @brief           启动一个分配的Timer.
 * 
 * @param[in]       handle              Timer操作句柄
 * @param[in]       period              Timer周期, 单位微妙
 * @param[in]       pulse               pwm 脉冲宽度(非PWM模式可设置为0)，单位微妙
 * @param[in]       timMode             Timer 模式：单次TIMER_ONE_SHOT_MODE,周期性TIMER_PERIOD_MODE
 * @param[in]       deltaTime           用于省电补偿timer时间, 参数为补偿的差值, 此参数非0才有含义
 * 
 * @return          返回值.
 * @retval          0                   成功
 *                  !0                  失败
 ************************************************************************************
 */
int8_t TIM_Startup(TIM_Handle* handle, uint32_t period, uint32_t pulse, uint8_t timMode, uint64_t deltaTime);

/**
 ************************************************************************************
 * @brief           中止Timer运行.
 *
 * @param[in]       handle            Timer操作句柄
 * 
 * @retval          0                   成功
 *                  !0                  失败
 ************************************************************************************
 */
int8_t TIM_Abort(TIM_Handle* handle);

/**
 ************************************************************************************
 * @brief           打开/关闭 Timer PWM功能.
 * 
 * @param[in]       handle              Timer操作句柄
 * @param[in]       enable              true: 打开PWM  false: 关闭PWM
 * 
 * @return          返回值.
 * @retval          0                   成功
 *                  !0                  失败
 ************************************************************************************
 */
int8_t TIM_EnablePwm(TIM_Handle* handle, bool enable);

/**
 ************************************************************************************
 * @brief           延时.
 * 
 * @param[in]       handle              Timer操作句柄
 * @param[in]       uSec                延时时间，单位微妙
 * 
 * @return          void.
 ************************************************************************************
 */
void TIM_DelayUs(TIM_Handle *handle, uint32_t uSec);

/**
 ************************************************************************************
 * @brief           获取Timer时间戳.
 * 
 * @param[in]       handle              Timer操作句柄
 * 
 * @return          返回值.
 * @retval          返回时间戳                
 ************************************************************************************
 */
uint64_t TIM_GetTimeStamp(TIM_Handle *handle);

/**
 ************************************************************************************
 * @brief           获取Timer可设的最大周期值.
 * 
 * @param[in]       handle              Timer操作句柄
 * 
 * @return          返回值.
 * @retval          返回最大周期值，单位微妙                
 ************************************************************************************
 */
uint64_t TIM_GetMaxPeriod(TIM_Handle *handle);

#ifdef _PLAT_TEST
/**
 ************************************************************************************
 * @brief           获取Timer当前counter计数值.
 *
 * @param[in]       handle              Timer操作句柄
 *
 * @return          返回值.
 * @retval          返回counter计数值
 ************************************************************************************
 */
uint32_t TIM_GetCurrentCount(TIM_Handle *handle);

/**
 ************************************************************************************
 * @brief           获取Timer工作时钟.
 *
 * @param[in]       handle              Timer操作句柄
 *
 * @return          返回值.
 * @retval          返回Timer工作时钟，单位Hz
 ************************************************************************************
 */
uint32_t TIM_GetTimerClock(TIM_Handle *handle);
#endif

/**
 ************************************************************************************
 * @brief           设置pwm时钟.
 * 
 * @param[in]       timSet              pwmTimer选择
 * 
 * @return          void.              
 ************************************************************************************
 */
void TIM_SetPwmTimer(uint8_t timSet);

/**
 ************************************************************************************
 * @brief           获取pwm时钟.
 * 
 * @param[in]       void
 * 
 * @return          返回值.
 * @retval          返回选择的pwm时钟                
 ************************************************************************************
 */
uint8_t TIM_GetPwmTimer(void);

#endif

/** @} */