/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        drv_lp.h
 *
 * @brief       standby模式低功耗接口
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-05-11     ICT Team          创建
 ************************************************************************************
 */

#ifndef __DRV_LP__
#define __DRV_LP__

/**
 * @addtogroup LowPower
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/

#define SBY_FILEPATH    "/tmp/standby_save.data"

typedef enum {
    NAS_REQ = 0,
    RRC_REQ,
    ATI_REQ,
    APP_REQ,
    PHY_REQ,
    NET_REQ,
    RTC_REQ,
    PCU_REQ,
    MAX_REQ,
}LP_SbyMemReqFlag;

typedef void (* LP_SbyRecoverFunc)(void);

/************************************************************************************
\brief: 部分驱动初始化流程，在sby恢复流程之前，无法在其初始化流程中恢复sby保存的数据。
        需在sby初始化时调用的恢复接口使用该接口声明。
*************************************************************************************/
#define SBYDRVINIT_EXPORT(fn)                                               \
    OS_USED LP_SbyRecoverFunc __psm_sbyinit_##fn SECTION(".psm_sbydrvinit_func") = fn;

/************************************************************************************
 *                                 函数定义
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief           使能/禁用standby流程
 *
 * @param[in]       en                 使能/禁用
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void LP_SbyEn(uint32_t en);

/**
 ************************************************************************************
 * @brief           获取standby 标志
 *
 * @param[in]       void
 *
 * @return          uint32_t
 * @retval          1               在sby流程中
 *                  0               非sby流程
 ************************************************************************************
*/
uint32_t LP_IsInSbyFlow(void);

/**
 ************************************************************************************
 * @brief           申请standby保存数据的内存地址
 *
 * @param[in]       size 占用的内存大小
 *                  flag 申请内存的模块
 *
 * @return          uint8_t * 内存指针
 * @retval
 ************************************************************************************
*/
uint8_t *LP_GetSbySaveAddr(uint32_t size, LP_SbyMemReqFlag flag);

/**
 ************************************************************************************
 * @brief           申请standby恢复数据的内存地址
 *
 * @param[in]       size 占用的内存大小
 *                  flag 申请内存的模块
 *
 * @return          uint8_t * 内存指针
 * @retval
 ************************************************************************************
*/
uint8_t *LP_GetSbyRestoreAddr(uint32_t *size, LP_SbyMemReqFlag flag);

/**
 ************************************************************************************
 * @brief           释放standby恢复数据的内存地址
 *
 * @param[in]       flag 释放内存的模块
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void LP_FreeSbyRestoreAddr(LP_SbyMemReqFlag flag);

/**
 ************************************************************************************
 * @brief           保存standby休眠数据
 *
 * @param[in]       buf                 数据buf起始地址
 * @param[in]       size                数据buf大小
 *
 * @return          uint32_t
 * @retval          DRV_OK              保存成功
 *                  DRV_ERR             保存异常
 ************************************************************************************
*/
int32_t LP_SbySaveData(void);

/**
 ************************************************************************************
 * @brief           读取standby休眠数据
 *
 * @param[in]       void
 *
 * @return          uint32_t
 * @retval          DRV_ERR             读取异常
 *                  other               实际读取的数据大小
 ************************************************************************************
*/
int32_t LP_SbyRestoreData(void);

#endif
/** @} */