/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        drv_reset.h
 *
 * @brief       reset驱动代码
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-09-11     ICT Team          创建
 ************************************************************************************
 */
#ifndef __DRV_RESET__
#define __DRV_RESET__

/************************************************************************************
 *                                 头文件定义
 ************************************************************************************/
#include <drv_common.h>
#include <drv_pcu.h>

/**
 * @addtogroup Reset
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
/* the diffrent reset info */
typedef enum 
{
    RESET_TO_DOWNLOAD = 1,    /* reset to download */
    RESET_TO_STANDBY,         /* reset to standby */
    RESET_TO_NORMAL,          /* reset to idle */
    RESET_TO_CHARGER,         /* reset to charger */
    RESET_TO_ALRAM,           /* reset to alarm */
    RESET_TO_EXCEPTRESET,
    RESET_TO_FOTA_UPDATE,
    MAX_RESET_TYPE,
} T_Drv_Reset_Type;

/* the power on info */
typedef enum 
{
    POWER_ON_NORMAL = 0,
    POWER_ON_CHARGING,
    POWER_ON_ALRAM,
    POWER_ON_EXCEPTRESET,
    POWER_ON_FOTA,
    POWER_ON_RTC,
    POWER_ON_RESET,
    POWER_ON_HDT_TEST,
    POWER_ON_LOCALUPDATE,
    POWER_ON_BOOST_IN,
    POWER_ON_AMT,
    POWER_ON_PRODUCTION,
    POWER_ON_WDT,
    POWER_ON_STANDBY,
    POWER_ON_INVALID,
}T_Drv_PowerOn_Type;

typedef enum 
{
    SYS_POR5_RSTN_FLAG,
    SYS_EXT_RSTN_FLAG,
    SYS_GLOBAL_SW_RSTN_FLAG,
    SYS_APSS_WDT_RSTN_FLAG,
    SYS_CPSS_WDT_RSTN_FLAG,
    SYS_UNKNOW_RSTN_FLAG,
    SYS_MAX_RESET_REASON,
}T_Sys_Reset_Reason;

/************************************************************************************
 *                                 变量定义
 ************************************************************************************/

/************************************************************************************
 *                                 函数定义
 ************************************************************************************/
/**
 ************************************************************************************
 * @brief           系统重启底层驱动接口
 *
 * @return          无.
 * @note  注意系统重启机接口使用 osShutdown
 ************************************************************************************
*/
void DRV_Reboot(T_Drv_Reset_Type reset_type);

/**
 ************************************************************************************
 * @brief           设置复位标记
 *
 * @return          无.
 ************************************************************************************
*/
void DRV_SetResetFlag(T_Drv_Reset_Type reset_type);

/**
 ************************************************************************************
 * @brief           清除复位标记
 *
 * @return          无.
 ************************************************************************************
*/
void DRV_CleanResetFlag(void);

/**
 ************************************************************************************
 * @brief           系统关机底层驱动接口
 *
 * @return          无.
 * @note  注意系统关机接口使用 osShutdown
 ************************************************************************************
*/
#define DRV_ShutDown()  PCU_ShutDown()

/**
 ************************************************************************************
 * @brief           根据重启原因获取开机类型
 *
 * @return          开机类型.
 ************************************************************************************
*/
T_Drv_PowerOn_Type Drv_GetPowerOnState(void);

/**
 ************************************************************************************
 * @brief           获取开机类型
 *
 * @return          开机类型.
 ************************************************************************************
*/
T_Drv_PowerOn_Type DrvGetPowerOnStat(void);

/**
 ************************************************************************************
 * @brief           设置开机类型
 *
 * @return          开机类型.
 ************************************************************************************
*/
void DrvSetPowerOnStat(T_Drv_PowerOn_Type stat);

/**
 ************************************************************************************
 * @brief           根据复位原因获取复位开机类型
 *
 * @return          复位开机类型.
 ************************************************************************************
*/
T_Sys_Reset_Reason Sys_GetResetReason(void);

/**
 ************************************************************************************
 * @brief           设置是否WDT复位
 *
 * @param[in]       wdtRst      是否WDT复位
 *
 * @return          void
 ************************************************************************************
*/
void Sys_SetWDTReset(bool wdtRst);

/**
 ************************************************************************************
 * @brief           获取WDT复位原因
 *
 * @param[in]
 *
 * @return          bool    是否WDT复位
 * @retval
 ************************************************************************************
*/
bool Sys_GetWDTReset(void);

/**
 ************************************************************************************
 * @brief           获取开机类型和异常信息
 *
 * @param[in]       info    存储信息的地址
 * @param[in]       len     存储信息的长度
 *
 * @return          是否需要保存到文件.
 ************************************************************************************
*/
bool_t PMU_GetResetInfo(char *info, size_t len);

#endif /* __DRV_RESET__ */
/** @} */