/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        drv_rtc.h
 *
 * @brief       RTC驱动接口.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-04-21     ict team          创建
 ************************************************************************************
 */

#ifndef _DRV_RTC_H_
#define _DRV_RTC_H_

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include "drv_common.h"

/**
 * @addtogroup Rtc
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/

/**
 * @brief 函数返回值
 */
#define         RTC_OK              DRV_OK
#define         RTC_ERROR           (DRV_ERR_SPECIFIC - 1)
#define         RTC_ALARM_FULL      (DRV_ERR_SPECIFIC - 2)
#define         RTC_PARA_ERR        (DRV_ERR_SPECIFIC - 3)


/**
 * @brief RTC 最大支持闹钟个数
 */
#define         MAX_RTC_ALARM           3

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/

/**
 * @brief UNIX时间类型
 */
typedef int64_t RTC_Time;

/**
 * @brief 标准时间结构体
 */
struct RTC_Date {
  int tm_sec;           /*    秒.   [0-60] */
  int tm_min;           /*    分钟. [0-59] */
  int tm_hour;          /*    小时. [0-23] */
  int tm_mday;          /*    日.   [1-31] */
  int tm_mon;           /*    月.   [0-11] */
  int tm_year;          /*    年 - 1900.   */
  int tm_wday;          /*    星期. [0-6]  */
  int tm_yday;          /*    年日. [0-365]*/
};

struct RTC_DateTime {
  int tm_year;          /*    年 >   1900.  */
  int tm_mon;           /*    月.    [1-12] */
  int tm_mday;          /*    日.    [1-31] */
  int tm_hour;          /*    小时. [0-23] */
  int tm_min;           /*    分钟. [0-59] */
  int tm_sec;           /*    秒.    [0-59] */
};
typedef void (*RTC_AlarmCallBackType)(void *arg);
/**
 * @brief RTC 闹钟信息结构体
 */
typedef struct
{
    RTC_Time alarmTime;                 /* 闹钟时间 */
    uint64_t para;                      /* 睡眠唤醒提供保存的用户参数，大小8个字节。该参数会随RtcAlarmInfo结构体传递给用户回调 */
    RTC_AlarmCallBackType func;         /* 回调接口 */
}RtcAlarmInfo;


/**
 ************************************************************************************
 * @brief           注册一个RTC闹钟.
 *
 * @param[in]       alarmTime               闹钟时间
 * @param[in]       para                    睡眠唤醒提供保存的用户参数，大小8个字节。该参数会随RtcAlarmInfo结构体传递给用户回调
 * @param[in]       callBack                闹钟回调,闹钟回调中不要执行太多代码，
 *                                          避免alarm 任务栈溢出，建议使用消息，事件等
 * @return          初始化返回值.
 * @retval          >=0                     闹钟ID
 *                  < 0                     失败
 ************************************************************************************
 */
int32_t RTC_RegisterAlarm(RTC_Time alarmTime, uint64_t para, RTC_AlarmCallBackType callBack);

/**
 ************************************************************************************
 * @brief           注销一个RTC闹钟.
 *
 * @param[in]       id                      闹钟ID，RTC_RegisterAlarm 返回值
 *
 * @return          返回值.
 * @retval          ==0                     成功
 *                  < 0                     失败
 ************************************************************************************
 */
int32_t RTC_UnregisterAlarm(uint8_t id);

/**
 ************************************************************************************
 * @brief           获取注册的闹钟.
 *
 * @param[in]       void
 *
 * @return          RtcAlarmInfo *, 指向存储闹钟的数组.

 ************************************************************************************
 */
RtcAlarmInfo *RTC_GetAlarmInfo(void);

/**
 ************************************************************************************
 * @brief           获取最近一个RTC闹钟.
 *
 * @param[in]       void
 *
 * @return          返回值.
 * @retval          >0                       成功
 *                  <= 0                     失败
 ************************************************************************************
 */
RTC_Time RTC_GetMinAlarm(void);
/**
 ************************************************************************************
 * @brief           标准时间转UNIX时间.
 *
 * @param[in]       t                       标准时间
 *
 * @return          返回值.
 * @retval          UNIX时间
 ************************************************************************************
 */
RTC_Time RTC_MkTime(struct RTC_Date * const t);

/**
 ************************************************************************************
 * @brief           UNIX时间转标准时间.
 *
 * @param[in]       t                       UNIX时间
 *
 * @return          返回值.
 * @retval          标准时间
 * @note            不支持时区
 ************************************************************************************
 */
struct RTC_Date RTC_LocalTime(const RTC_Time* t);

/**
 ************************************************************************************
 * @brief           获取RTC时间.
 *
 * @param[in]       void
 *
 * @return          返回值.
 * @retval          UNIX时间
 * @note            RTC维护本地时间
 ************************************************************************************
 */
RTC_Time RTC_GetTime(void);
/**
 ************************************************************************************
 * @brief           获取标准时间.
 *
 * @param[in]       time 通过参数读取的RTC时间
 *
 * @return          返回值.
 * @retval          ==0                     成功
 *                  < 0                     失败
 * @note            RTC维护本地时间
 ************************************************************************************
 */
int32_t RTC_GetDateTime(struct RTC_DateTime *time);
/**
 ************************************************************************************
 * @brief           设置RTC 时间.
 *
 * @param[in]       time                    设置的时间
 *
 * @return          返回值.
 * @retval          ==0                     成功
 *                  < 0                     失败
 * @note            RTC维护本地时间
 ************************************************************************************
 */
int32_t RTC_SetTime(RTC_Time time);

/**
 ************************************************************************************
 * @brief           设置RTC 时间.
 *
 * @param[in]       t                       设置的时间结构体
 *
 * @return          返回值.
 * @retval          ==0                     成功
 *                  < 0                     失败
 * @note            RTC维护本地时间
 ************************************************************************************
 */
int32_t RTC_SetDateTime(struct RTC_DateTime t);
/**
 ************************************************************************************
 * @brief           RTC初始化.
 *
 * @param[in]       void
 *
 * @return          返回值.
 * @retval          ==0                     成功
 *                  < 0                     失败
 ************************************************************************************
 */
int RTC_Initialize(void);

/**
 ************************************************************************************
 * @brief           RTC 设置时区.
 *
 * @param[in]       zone        设置的时区
 *
 * @return          返回值.
 * @retval          ==0                     成功
 *                  < 0                     失败
 * @note          时区值单位是15分钟，unit : quarters of an hour
 ************************************************************************************
 */
int RTC_SetZone(int8_t zone);

/**
 ************************************************************************************
 * @brief           RTC 获取时区.
 *
 * @param[in]       *zone       时区值
 *
 * @return          返回值.
 * @retval          ==0                     成功
 *                  < 0                     失败
 * @note          时区值单位是15分钟，unit : quarters of an hour
 ************************************************************************************
 */
int RTC_GetZone(int8_t *zone);

#endif
/** @} */