/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        vfs.h
 *
 * @brief       文件系统接口定义.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-04-21   ict team        创建
 * 2023-11-27   ict team        按C库文件接口函数原型实现文件操作(不支持文本模式)
 *
 * @note    当前版本不支持 fflush 接口，使用 VFS_SyncFile 替代
 ************************************************************************************
 */


#ifndef _OS_VFS_H_
#define _OS_VFS_H_

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stdio.h>
#include <dirent.h>
#include <os.h>
/************************************************************************************
 *                                 配置开关
 ************************************************************************************/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
/**
 * 文件路径最大长度
 */
#ifndef VFS_PATH_MAX
#define VFS_PATH_MAX 255
#endif

/**
 * 文件名最大长度
 */

#ifndef VFS_NAME_MAX
#define VFS_NAME_MAX 255
#endif

/**@name 文件系统返回值定义
 * @{
 */

#define VFS_EOK              0  ///< 成功
#define VFS_ERROR           -1  ///< 错误
#define VFS_ENOENT          -2  ///< 文件(夹)不存在
#define VFS_EIO             -5  ///< I/O 错误
#define VFS_EBADF           -9  ///< 无效文件句柄
#define VFS_ENOMEM          -12 ///< 内存不足
#define VFS_EACCES          -13 ///< 无权访问
#define VFS_EBUSY           -16 ///< 资源占用
#define VFS_EEXIST          -17 ///< 文件(夹)已存在
#define VFS_ENODEV          -19 ///< 设备不存在
#define VFS_ENOTDIR         -20 ///< 非文件夹
#define VFS_EISDIR          -21 ///< 文件夹
#define VFS_EINVAL          -22 ///< 参数无效
#define VFS_EFBIG           -27 ///< 文件太大
#define VFS_ENOSPC          -28 ///< 磁盘空间不足
#define VFS_EROFS           -30 ///< 只读文件系统
#define VFS_ENAMETOOLONG    -36 ///< 文件名太长
#define VFS_ENODATA         -61 ///< 无数据
#define VFS_EILSEQ          -84 ///< 数据错误

/** @}*/

/**@name 文件系统标志定义
 * @{
 */

#define VFS_O_RDONLY        0
#define VFS_O_WRONLY        1
#define VFS_O_RDWR          2

#define VFS_O_APPEND        0x0008
#define VFS_O_CREAT         0x0200
#define VFS_O_TRUNC         0x0400
#define VFS_O_EXCL          0x0800

#define VFS_O_ACCMODE       (VFS_O_RDONLY | VFS_O_WRONLY | VFS_O_RDWR)

#define VFS_DT_UNKNOWN      0
#define VFS_DT_DIR          4
#define VFS_DT_REG          8


#define VFS_SEEK_SET        0
#define VFS_SEEK_CUR        1
#define VFS_SEEK_END        2

#define VFS_S_IFMT          00170000
#define VFS_S_IFREG         0100000
#define VFS_S_IFDIR         0040000

#define VFS_S_ISREG(m)      (((m)&VFS_S_IFMT) == VFS_S_IFREG)
#define VFS_S_ISDIR(m)      (((m)&VFS_S_IFMT) == VFS_S_IFDIR)

/** @}*/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
typedef long VFS_Off;

typedef unsigned int VFS_Mode;
/**
 * @brief 文件句柄
 */
typedef FILE    VFS_File;

/**
 * @brief 目录句柄
 */
typedef DIR     VFS_Dir;

/**
 * @brief 文件入口对象
 */
typedef struct dirent VFS_Dirent;

/**
 * @brief 文件或目录信息
 */
typedef struct {
    VFS_Mode        st_mode;                ///< 文件模式
    size_t          st_size;                ///< 文件大小， 类型为文件时, 有效
}VFS_FileStat;

/**
 * @brief 文件系统信息
 */
typedef struct {
    size_t          blkSize;     ///< 块大小
    size_t          blkCount;    ///< 块总数量
    size_t          blkFree;     ///< 未使用的块总数量
}VFS_FSStat;

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 函数定义
 ************************************************************************************/

/* 文件 API */

/**
 ************************************************************************************
 * @brief           打开文件.
 *
 * @param[in]       path            文件路径;
 * @param[in]       mode            打开标志;
 *
 * @return          文件句柄
 * @retval          !NULL           打开成功;
 *                  NULL            打开失败,可调用错误码接口获取失败原因;
 ************************************************************************************
 */
VFS_File* VFS_OpenFile(const char *path, const char *mode);

/**
 ************************************************************************************
 * @brief           关闭文件.
 *
 * @param[in]       fp              文件句柄;
 * @return          操作结果
 *
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_CloseFile(VFS_File *fp);

/**
 ************************************************************************************
 * @brief           从文件读取数据.
 *
 * @param[out]      buf             数据缓存地址;
 * @param[in]       size            读取块长度;
 * @param[in]       count           读取个数;
 * @param[in]       fp              文件句柄;
 *
 * @return          读取数据块的个数
 * @retval          > 0             读取数据块的个数;
 *                  = 0             读到文件尾或出错,可调用错误码接口获取失败原因;
 ************************************************************************************
 */
size_t VFS_ReadFile(void *buf, size_t size, size_t count, VFS_File *fp);

/**
 ************************************************************************************
 * @brief           向文件写入数据.
 *
 * @param[in]       buf             数据缓存地址;
 * @param[in]       size            写入块长度;
 * @param[in]       count           写入个数;
 * @param[in]       fp              文件句柄;
 *
 * @return          写入数据块的个数
 * @retval          > 0             写入的字节数;
 *                  = 0             失败,可调用错误码接口获取失败原因;
 ************************************************************************************
 */
size_t VFS_WriteFile(const void *buf, size_t size, size_t count, VFS_File *fp);

/**
 ************************************************************************************
 * @brief           修改文件偏移.
 *
 * @param[in]       fp              文件句柄;
 * @param[in]       offset          偏移;
 * @param[in]       whence          从何处开始;
 *
 * @return          文件偏移
 * @retval          = 0             成功;
 *                  < 0             失败原因;
 ************************************************************************************
 */
int VFS_SeekFile(VFS_File *fp, long offset, int whence);

/**
 ************************************************************************************
 * @brief           获取文件偏移.
 *
 * @param[in]       fp              文件句柄;
 *
 * @return          文件偏移
 * @retval          >= 0            当前偏移;
 *                  < 0             失败原因;
 ************************************************************************************
 */
long VFS_GetFilePosition(VFS_File *fp);

/**
 ************************************************************************************
 * @brief           将文件数据刷入存储.
 *
 * @param[in]       fp              文件句柄;
 *
 * @return          操作结果
 * @retval          = 0             成功;
 *                  < 0             失败原因;
 ************************************************************************************
 */
int VFS_SyncFile(VFS_File *fp);

/**
 ************************************************************************************
 * @brief           获取文件长度.
 *
 * @param[in]       fp              文件句柄;
 *
 * @return          文件长度
 * @retval          >= 0            文件长度;
 *                  < 0             失败原因;
 ************************************************************************************
 */
long VFS_GetFileSize(VFS_File *fp);

/**
 ************************************************************************************
 * @brief           设置文件长度.
 *
 * @param[in]       fp              文件句柄;
 * @param[in]       len             文件长度;
 *
 * @return          文件长度
 * @retval          >= 0            文件长度;
 *                  < 0             失败原因;
 ************************************************************************************
 */
int VFS_TruncateFile(VFS_File *fp, size_t len);


/* 目录 API */
/**
 ************************************************************************************
 * @brief           创建目录.
 *
 * @param[in]       path            目录路径;
 * @param[in]       mode            目录模式;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败原因;
 ************************************************************************************
 */
int VFS_MakeDir(const char *path, mode_t mode);

/**
 ************************************************************************************
 * @brief           打开目录.
 *
 * @param[in]       path            目录路径;
 *
 * @return          目录句柄
 * @retval          !NULL           打开成功;
 *                  NULL            打开失败, 可调用错误码接口获取失败原因;
 ************************************************************************************
 */
VFS_Dir* VFS_OpenDir(const char *path);

/**
 ************************************************************************************
 * @brief           关闭目录.
 *
 * @param[in]       dp              目录句柄;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_CloseDir(VFS_Dir *dp);

/**
 ************************************************************************************
 * @brief           读取目录子项.
 *
 * @param[in]       dp              目录句柄;
 *
 * @return          目录子项指针
 * @retval          !NULL           读取成功;
 *                  NULL            打开失败或读取结束, 调用错误码接口获取失败原因;
                                    当错误码为VFS_EOK时, 表示读完所有子项;
 ************************************************************************************
 */
VFS_Dirent* VFS_ReadDir(VFS_Dir *dp);

/**
 ************************************************************************************
 * @brief           获取当前目录子项偏移.
 *
 * @param[in]       dp              目录句柄;
 *
 * @return          目录子项偏移
 * @retval          >= 0            目录子项偏移;
 *                  < 0             获取失败;
 ************************************************************************************
 */
off_t VFS_TellDir(VFS_Dir *dp);

/**
 ************************************************************************************
 * @brief           设置当前目录子项偏移.
 *
 * @param[in]       dp              目录句柄;
 * @param[in]       offset          偏移;
 *
 * @return          无
 ************************************************************************************
 */
void VFS_SeekDir(VFS_Dir *dp, off_t offset);

/**
 ************************************************************************************
 * @brief           倒退目录子项到开始位置.
 *
 * @param[in]       dp              目录句柄;
 *
 * @return          无
 ************************************************************************************
 */
void VFS_RewindDir(VFS_Dir *dp);

/**
 ************************************************************************************
 * @brief           删除目录, 目录为空时方可删除.
 *
 * @param[in]       path            目录路径;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_RmDir(const char *path);

/**
 ************************************************************************************
 * @brief           修改当前工作目录;
 *                  当 VFS_SUPPORT_CWD 关闭时, 工作目录为根目录，且无法修改.
 *
 * @param[in]       path            目录路径;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_ChangeDir(const char *path);

/**
 ************************************************************************************
 * @brief           获取当前工作目录;
 *                  当 VFS_SUPPORT_CWD 关闭时, 返回根目录.
 *
 * @param[out]      buf             路径缓存区指针, 可为 NULL;
 * @param[in]       size            缓存区长度, 可为 0;
 *
 * @return          当前工作目录字符串的首地址.
 * @note            当 buf 为 NULL 且 size 为 0 时, 返回的内存地址由调用者释放.
 ************************************************************************************
 */
char* VFS_GetCwd(char *buf, size_t size);

/* 文件 & 目录 */
/**
 ************************************************************************************
 * @brief           重命名目录或文件的名称.
 *
 * @param[in]       oldName         原路径;
 * @param[in]       newName         新路径;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_Rename(const char *oldName, const char *newName);

/**
 ************************************************************************************
 * @brief           删除目录或文件.
 *
 * @param[in]       path            路径;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_Unlink(const char *path);

/**
 ************************************************************************************
 * @brief           检测目录或文件是否存在.
 *
 * @param[in]       path            路径;
 * @param[in]       mode            访问模式;
 *
 * @return          操作结果
 * @retval          VFS_EOK         存在;
 *                  < 0             失败或不存在;
 ************************************************************************************
 */
int VFS_Access(const char *path, int mode);

/**
 ************************************************************************************
 * @brief           获取目录或文件信息.
 *
 * @param[in]       path            路径;
 * @param[in]       stat            存储信息指针, 不可为空;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_Stat(const char *path, VFS_FileStat *stat);

/*  文件系统 */

/**
 ************************************************************************************
 * @brief           挂载文件系统.
 *
 * @param[in]       devName         设备名称;
 * @param[in]       fsName          文件系统名称;
 * @param[in]       path            挂载路径;
 * @param[in]       flags           挂载标志;
 *
 * @return          操作结果
 * @retval          VFS_EOK         挂载成功;
 *                  < 0             挂载失败;
 ************************************************************************************
 */
int VFS_Mount(const char *devName, const char *fsName, const char *path, int flags);

/**
 ************************************************************************************
 * @brief           卸载文件系统.
 *
 * @param[in]       path            文件系统路径;
 *
 * @return          操作结果
 * @retval          VFS_EOK         卸载成功;
 *                  < 0             卸载失败;
 ************************************************************************************
 */
int VFS_Unmount(const char *path);

/**
 ************************************************************************************
 * @brief           格式化文件系统.
 *
 * @param[in]       devName         设备名称;
 * @param[in]       fsName          文件系统名称;
 *
 * @return          操作结果
 * @retval          VFS_EOK         格式化成功;
 *                  < 0             格式化失败;
 ************************************************************************************
 */
int VFS_MakeFS(const char *devName, const char *fsName);

/**
 ************************************************************************************
 * @brief           获取文件系统信息.
 *
 * @param[in]       path            文件系统路径;
 * @param[in]       stat            存储信息指针, 不可为空;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_StatFS(const char *path, VFS_FSStat *stat);

/**
 ************************************************************************************
 * @brief           获取文件系统用户空间的信息.
 *
 * @param[in]       path            文件系统路径;
 * @param[in]       stat            存储信息指针, 不可为空;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_StatFSUser(const char *path, VFS_FSStat *stat);

/**
 ************************************************************************************
 * @brief           同步所有文件已修改的数据写入文件系统.
 *
 * @param[in]       path            文件系统路径;
 *
 * @return          操作结果
 * @retval          VFS_EOK         成功;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_Sync(const char *path);

/**
 ************************************************************************************
 * @brief           文件系统是否活跃(存在打开的文件或目录).
 *
 * @return          活跃状态
 * @retval          OS_TRUE         活跃;
 *                  OS_FALSE        非活跃;
 ************************************************************************************
 */
bool_t VFS_IsActive(void);

/**
 ************************************************************************************
 * @brief           文件系统评估下目录或文件所消耗的flash块个数.
 *
 * @param[in]       dir             是否是目录;
 * @param[in]       size            文件的大小;
 *
 * @return          flash块个数.
 ************************************************************************************
 */
size_t VFS_EvaluateBlock(bool_t dir, size_t size);

/**
 ************************************************************************************
 * @brief           回收文件系统空闲块; 系统空闲时, 调用则尝试回收一个空闲块.
 *
 * @param[in]       path            文件系统路径;
 *
 * @return          剩余待回收的空闲块
 * @retval          >= 0            当大于 0 时, 根据系统空闲状态继续调用;
 *                  < 0             失败;
 ************************************************************************************
 */
int VFS_RecycleOneBlock(const char *path);

#ifdef __cplusplus
}
#endif


#endif /*_OS_VFS_H_*/
