/**
 *************************************************************************************
 * 版权所有 (C) 2023, 芯昇科技有限公司
 * 保留所有权利。
 *
 * @file        psm_sys.h
 *
 * @brief       PSM驱动代码
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-05-11     ICT Team          创建
 ************************************************************************************
 */
#ifndef __PSM_SYS__
#define __PSM_SYS__

/************************************************************************************
 *                                 头文件定义
 ************************************************************************************/
#include <os_def.h>
#include <psm_common.h>
#include <psm_core.h>
#include <drv_pcu.h>
/**
 * @addtogroup Psm
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/
#define PSM_APSLEEP_FLAG_BIT                    (0)
#define PSM_CPSLEEP_FLAG_BIT                    (1)
#define PSM_PSSLEEP_FLAG_BIT                    (2)
#define PSM_PHYSLEEP_FLAG_BIT                   (3)
#define CORE_NOP3                               do{asm volatile("nop\n" "nop\n" "nop\n");}while(0)

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
typedef enum {
    BUSY_FLAG_APSS_DMA          = (1 << 0),
    BUSY_FLAG_APSS_SDIO         = (1 << 1),
    BUSY_FLAG_APSS_SPIFC        = (1 << 2),
    BUSY_FLAG_APSS_UICC         = (1 << 3),
    BUSY_FLAG_APSS_LP_UART      = (1 << 4),
    BUSY_FLAG_APSS_BUSMUX       = (1 << 5),
    APSS_PERI_MASK = BUSY_FLAG_APSS_DMA | BUSY_FLAG_APSS_SDIO | BUSY_FLAG_APSS_SPIFC | BUSY_FLAG_APSS_UICC | BUSY_FLAG_APSS_LP_UART | BUSY_FLAG_APSS_BUSMUX,
} PSM_PeriBusyFlag;

typedef enum {
    PSM_CpDeepSleep  = 1,
    PSM_PsmStandby   = 2,
    PSM_PsmDeepSleep = 3,
} PSM_PsmSleepFlag;

typedef enum {
    PSM_DEFAULT_CASE  = 0,
    PSM_PS_TIMER,
    PSM_EDRX,
    PSM_PSM,
    PSM_SWITCH_RC_CASE,
    PSM_CFUN0 = PSM_SWITCH_RC_CASE,
    PSM_CFUN4,
    PSM_LOC,
} PSM_PsmSleepCase;

enum {
    PSM_FLOW_OUT        = 0,
    PSM_FLOW_GETMODE    = 1,
    PSM_FLOW_CHECKSU    = 2,
    PSM_FLOW_IRQEN      = 3,
};

typedef enum {
    PSM_LEVEL_ID        = 0,
    PSM_DSOPTIMIZE_ID   = 1,
    PSM_DS26MDCXOEN_ID  = 2,
} PSM_NvId;

enum {
    PSM_LEVEL_IDLE      = 0,
    PSM_LEVEL_DS        = 1,
    PSM_LEVEL_DS_SBY    = 2,
};

/************************************************************************************
 *                                 函数定义
 ************************************************************************************/
/**
 ************************************************************************************
 * @brief           尝试获取互斥锁
 *
 * @param[in]       void
 *
 * @return          DRV_ERR_BUSY 未获取互斥锁
 * @return          DRV_OK       获取到互斥锁
 ************************************************************************************
*/
static SECTION_IRAM_FUNC int PSM_TryGetLock(void)
{
    if (READ_U32(AON_SPINLOCK0_ADDR) == 1)
        return DRV_ERR_BUSY;
    return DRV_OK;
}

/**
 ************************************************************************************
 * @brief           阻塞获取互斥锁
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
static SECTION_IRAM_FUNC void PSM_Lock(void)
{
    while(READ_U32(AON_SPINLOCK0_ADDR) == 1);
#ifdef PSM_DEBUG
#if defined(_CPU_AP)
    PSM_LOCK = 0x10;
#else
    PSM_LOCK = 0x20;
#endif
#endif
}

/**
 ************************************************************************************
 * @brief           释放互斥锁
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
static SECTION_IRAM_FUNC void PSM_Unlock(void)
{
    WRITE_U32(AON_SPINLOCK0_ADDR, 0);
#if defined(_CPU_AP)
    PSM_LOCK = 0x11;
#else
    PSM_LOCK = 0x21;
#endif
}

/**
 ************************************************************************************
 * @brief           设置phy休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetPhySleepFlag(void);

/**
 ************************************************************************************
 * @brief           设置ps休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetPsSleepFlag(void);

/**
 ************************************************************************************
 * @brief           设置cp休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetCpSleepFlag(void);

/**
 ************************************************************************************
 * @brief           设置ap休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetApSleepFlag(void);

/**
 ************************************************************************************
 * @brief           清除phy休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_ClrPhySleepFlag(void);

/**
 ************************************************************************************
 * @brief           清除ps休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_ClrPsSleepFlag(void);

/**
 ************************************************************************************
 * @brief           清除cp休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_ClrCpSleepFlag(void);

/**
 ************************************************************************************
 * @brief           清除ap休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_ClrApSleepFlag(void);

/**
 ************************************************************************************
 * @brief           检查phy是否休眠
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/

static inline bool_t PSM_IsPhySleep(void)
{
    return !!(PSM_SLEEPFLAG & (1 << PSM_PHYSLEEP_FLAG_BIT));
}

/**
 ************************************************************************************
 * @brief           检查ps是否休眠
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/

static inline bool_t PSM_IsPsSleep(void)
{
    return !!(PSM_SLEEPFLAG & (1 << PSM_PSSLEEP_FLAG_BIT));
}

/**
 ************************************************************************************
 * @brief           检查cp是否休眠
 *
 * @param[in]       void
 *
 * @return          bool_t
 ************************************************************************************
*/

static inline bool_t PSM_IsCpSleep(void)
{
    return !!(PSM_SLEEPFLAG & (1 << PSM_CPSLEEP_FLAG_BIT));
}

/**
 ************************************************************************************
 * @brief           检查ap是否休眠
 *
 * @param[in]       void
 *
 * @return          bool_t
 ************************************************************************************
*/
static inline bool_t PSM_IsApSleep(void)
{
    return !!(PSM_SLEEPFLAG & (1 << PSM_APSLEEP_FLAG_BIT));
}

/**
 ************************************************************************************
 * @brief           设置子系统休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
static inline void PSM_SetSubsysSleepFlag(void)
{
#if defined(_CPU_AP)
    PSM_SetApSleepFlag();
#else
    PSM_SetCpSleepFlag();
#endif
}

/**
 ************************************************************************************
 * @brief           清除子系统休眠标志
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
static inline void PSM_ClrSubsysSleepFlag(void)
{
#if defined(_CPU_AP)
    PSM_ClrApSleepFlag();
#else
    PSM_ClrCpSleepFlag();
#endif
}

/**
 ************************************************************************************
 * @brief           CP查询PSM休眠模式。
 *
 * @param[in]       void
 *
 * @return          PSM_PsmSleepFlag  休眠模式   :  2:PSM STANDBY 3:PSM DEEPSLEEP
 ************************************************************************************
*/
static inline PSM_PsmSleepFlag PSM_GetPsmSleepFlag(void)
{
    return PSM_CP_SLEEPCASE_FLAG;
}

/**
 ************************************************************************************
 * @brief           清PSM休眠模式 ，CP在异步唤醒时调用
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_ClrPsmSleepFlag(void);

/**
 ************************************************************************************
 * @brief           查询是否支持AP休眠
 *
 * @param[in]       void
 *
 * @return          bool_t
 ************************************************************************************
*/
static inline bool_t PSM_IsApSleepSupport(void)
{
    return !PSM_AP_OFF;
}

/**
 ************************************************************************************
 * @brief           查询是否支持CP休眠
 *
 * @param[in]       void
 *
 * @return          bool_t
 ************************************************************************************
*/
static inline bool_t PSM_IsCpSleepSupport(void)
{
    return !PSM_CP_OFF;
}

/**
 ************************************************************************************
 * @brief           置位外设Busy标志
 *
 * @param[in]       flag                外设Busy标志
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_SetPeriBusy(PSM_PeriBusyFlag flag);

/**
 ************************************************************************************
 * @brief           清外设Busy标志
 *
 * @param[in]       flag                外设Busy标志
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_ClrPeriBusy(PSM_PeriBusyFlag flag);

/**
 ************************************************************************************
 * @brief           输出系统休眠信息
 *                  1、子系统休眠状态;
 *                  2、子系统及全系统休眠次数;
 *                  3、cp本次唤醒时刻点(mrtr);
 *                  4、当前mrtr,cp输出有效休眠时长,(仅在ap输出);
 * @param[in]       uint8_t sleepenter 1/休眠前输出;0/休眠后输出
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_PrintSleepInfo(uint8_t sleepenter);

/**
 ************************************************************************************
 * @brief           查询休眠期间是否使用rc
 *
 * @param[in]       void
 *
 * @return          bool_t
 * @retval          true :使用RC，false：使用32k less
 ************************************************************************************
*/
static inline bool_t PSM_IsDeepsleepWithRc(void)
{
    return (PSM_SLEEPCASE >= PSM_SWITCH_RC_CASE);
}

/**
 ************************************************************************************
 * @brief           获取提前唤醒时长(ms)
 *
 * @param[in]       void
 *
 * @return          uint32_t
 * @retval          提前唤醒时长(ms)
 ************************************************************************************
*/
uint32_t PSM_GetAheadTime(void);

/**
 ************************************************************************************
 * @brief           设置休眠场景
 *
 * @param[in]       case 休眠场景
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_SetSleepCase(PSM_PsmSleepCase ce);

/**
 ************************************************************************************
 * @brief           调整cpu主频至最大
 *
 * @param[in]       void
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_ScalCoreFreqMax(void);

#ifdef OS_USING_PM
/**
 ************************************************************************************
 * @brief           清除AP relaxtimer记录
 *
 * @param[in]
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_relaxTimerClr(void);

/**
 ************************************************************************************
 * @brief           记录AP relaxtimer信息
 *
 * @param[in]       normalTime: relaxtimer 正常超时时长
 * @param[in]       relaxTime: relaxtimer wakeup超时偏移
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_relaxTimerRecord(uint64_t normalTime, uint32_t relaxTime);
#endif

#if defined(_CPU_AP)
/**
 ************************************************************************************
 * @brief           置位/清除 OS PSM启动标志
 *
 * @param[in]       en  1/0 置位/清除 OS PSM启动标志
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_SbyBootFlagCfg(uint8_t en);

/**
 ************************************************************************************
 * @brief           查询是否是standby启动
 *
 * @param[in]       void
 *
 * @return          bool_t
 * @retval          == true         standby启动
 *                  == false        非standby启动
 ************************************************************************************
*/
bool_t PSM_IsSbyBoot(void);

/**
 ************************************************************************************
 * @brief           配置是否支持standby低功耗模式
 *
 * @param[in]       bool_t  true：使能;    false: 禁用
 *
 * @return          void
 * @retval
 ************************************************************************************
*/
void PSM_StandbyEn(bool_t en);

/**
 ************************************************************************************
 * @brief           查询是否支持standby低功耗模式
 *
 * @param[in]       void
 *
 * @return          bool_t
 * @retval          == true         支持standby低功耗模式
 *                  != false        不支持standby低功耗模式
 ************************************************************************************
*/
bool_t PSM_IsStandbyEn(void);

/**
 ************************************************************************************
 * @brief           获取CP休眠时长（ms）
 *
 * @param[in]       void
 *
 * @return          uint32_t
 * @retval          == 0                CP未休眠
 *                  == 0xFFFFFFFF       CP长休眠，等待外部事件唤醒
 *                  > 0                 CP drx/edrx休眠时长
 ************************************************************************************
*/
uint32_t PSM_GetCpSleepTimeLenMs(void);

/**
 ************************************************************************************
 * @brief           通知cp进入指定休眠模式.   协议栈在进standby 或从standby转成deepsleep时设置
 *
 * @param[in]       flag        休眠模式   :  2:PSM STANDBY 3:PSM DEEPSLEEP
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetPsmSleepFlag(PSM_PsmSleepFlag flag);

/**
 ************************************************************************************
 * @brief           屏蔽phy唤醒中断
 *
 * @param[in]       void
 *
 * @return          void
 ************************************************************************************
*/
void PSM_MaskPhyWakeupInt(void);

/**
 ************************************************************************************
 * @brief           配置省电实时nv
 *
 * @param[in]       id     nvid
 * @param[in]       cfg    配置信息
 *
 * @return          uint32_t
 * @retval          DRV_ERR        配置失败
 *                  DRV_OK         配置成功
 ************************************************************************************
*/
uint32_t PSM_SetPsmNv(PSM_NvId id, uint8_t cfg);

/**
 ************************************************************************************
 * @brief           设置当前设备是否支持工具配置
 *
 * @param[in]       uint8_t     1:支持工具配置;0:不支持工具配置
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetDiag(uint8_t cfg);

/**
 ************************************************************************************
 * @brief           获取当前设备是否支持工具配置
 *
 * @param[in]       void
 *
 * @return          uint8_t
 * @retval          1:支持工具配置;0:不支持工具配置
 ************************************************************************************
*/
static inline uint8_t PSM_GetDiag(void)
{
    return PSM_DIAG;
}

/**
 ************************************************************************************
 * @brief           设置当前sby休眠门限时长
 *
 * @param[in]       uint16_t     sby休眠门限时长(s)
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetSbyThreholdTime(uint16_t len);

/**
 ************************************************************************************
 * @brief           设置sby下RTC唤醒时长
 * @param[in]       uint16_t     sby下RTC唤醒时长(s)
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetSbyRTCWakeupTime(uint16_t len);

/**
 ************************************************************************************
 * @brief           获取当前设备是否支持工具配置
 *
 * @param[in]       void
 *
 * @return          uint8_t
 * @retval          1:支持工具配置;0:不支持工具配置
 ************************************************************************************
*/
static inline uint16_t PSM_GetSbyRTCWakeupTime(void)
{
    return PSM_STANDBY_RTC_WUTIME;
}

/**
 ************************************************************************************
 * @brief           设置当前log uart时钟
 *
 * @param[in]       uint32_t     uart clk
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetLogUartClk(uint32_t clk);

/**
 ************************************************************************************
 * @brief           查询cp是否进入长休眠
 *
 * @param[in]       void
 *
 * @return          uint8_t
 * @retval          1：cp进入长休眠；0：cp未进入长休眠
 ************************************************************************************
*/
uint8_t PSM_IsCpSleepForever(void);

/**
 ************************************************************************************
 * @brief           查询dma支持的休眠模式
 *
 * @param[in]       void
 *
 * @return          PSM_Mode
 * @retval
 ************************************************************************************
*/
PSM_Mode PSM_GetDmaSleepMode(void);
#endif

/**
 ************************************************************************************
 * @brief           获取省电实时nv配置
 *
 * @param[in]       id     nvid
 *
 * @return          uint8_t
 * @retval          DRV_ERR     无效nvid
 *                  其他          nv配置
 ************************************************************************************
*/
uint8_t PSM_GetPsmNv(PSM_NvId id);

/**
 ************************************************************************************
 * @brief           设置cp唤醒帧信息
 *
 * @param[in]       sfn
 *                  mrtr
 *
 * @return          void
 ************************************************************************************
*/
void PSM_SetCPWakeUpInfo(uint32_t sfn, uint32_t mrtr);

/**
 ************************************************************************************
 * @brief           注册26M工作外设信息
 *
 * @param[in]       periDmaId:dma通道信息
 *
 * @return          void
 ************************************************************************************
*/
void PSM_Peri26MDmaChannelRegister(uint8_t periDmaId);

/**
 ************************************************************************************
 * @brief           注册26M工作外设信息
 *
 * @param[in]       periDmaId:dma通道信息
 *
 * @return          void
 ************************************************************************************
*/
void PSM_Peri26MDmaChannelUnregister(uint8_t periDmaId);

/**
 ************************************************************************************
 * @brief           获取当前设备是否支持工具配置
 *
 * @param[in]       void
 *
 * @return          uint8_t
 * @retval          1:支持工具配置;0:不支持工具配置
 ************************************************************************************
*/
static SECTION_IRAM_FUNC uint32_t PSM_GetLogUartClk(void)
{
    return PSM_LOG_UART_CLK;
}
#endif
/** @} */
